dependencies/OpenFOAM/tutorials/multiphase/interFoam/RAS/electrostaticDeposition/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 2;
        cAlpha          0.8;
        icAlpha         0;

        MULESCorr       yes;
        nLimiterIter    15;
        alphaApplyPrevCorr  no;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0;
        minIter         1;
    }

    "pcorr.*"
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-3;
        relTol          0;
    };

    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       5e-8;
        relTol          0.01;
    };

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         1;
        tolerance       1e-7;
        relTol          0.1;
        minIter         1;
    };

    "(U|k|omega)Final"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         1;
        tolerance       1e-7;
        relTol          0;
        minIter         1;
    };

    "electricPotential:V"
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor no;

    nOuterCorrectors 1;
    nCorrectors      3;
    nNonOrthogonalCorrectors 1;

    correctPhi      no;
    moveMeshOuterCorrectors no;
    turbOnFinalIterOnly yes;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    equations
    {
        ".*" 1;
        "electricPotential:V" 0.5;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
